tutorials/premixedFlame1D/0/p
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2006                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -1 -2 0 0 0 0];

internalField   uniform 101325;

boundaryField
{
    inlet
    {
        type            waveTransmissive;
        field           p;
        pis             thermo:psi;
        gamma           1.318654; //cp/cv (inlet)
        fieldInf        101325;
        value           uniform 101325;
    }

    outlet
    {
        type            waveTransmissive;
        field           p;
        pis             thermo:psi;
        gamma           1.272352; // cp/cv (outlet)
        fieldInf        101325;
        value           uniform 101325;
    }

    frontAndBack
    {
        type            empty;
    }
}

// ************************************************************************* //
