tutorials/premixedFlame1D/Allrun
#!/bin/sh

cd mechanism
xvf out.tgz
./runCmake.sh
cp build/libc_pyjac.so ../constant/
cd ..

cd ${0%/*} || exit 1    # Run from this directory

blockMesh

reactingFoam

