tutorials/premixedFlame1D/constant/chemistryProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2006                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      chemistryProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

chemistryType
{
    solver            odePyjac; //ode; odePyjac;
    method	      cemaPyjac; //standard; cemaPyjac;
}

chemistry       on;

initialChemicalTimeStep 1e-8;

odeCoeffs
{
    solver          seulex;
    absTol          1e-08;
    relTol          1e-05;
}

nElements        5;
// ************************************************************************* //
