tutorials/premixedFlame1D/constant/reactionsGRIPyjac
elements
5
(
O
H
C
N
Ar
)
;

species
53
(
H2
H
O
O2
OH
H2O
HO2
H2O2
C
CH
CH2
CH2(S)
CH3
CH4
CO
CO2
HCO
CH2O
CH2OH
CH3O
CH3OH
C2H
C2H2
C2H3
C2H4
C2H5
C2H6
HCCO
CH2CO
HCCOH
N
NH
NH2
NH3
NNH
NO
NO2
N2O
HNO
CN
HCN
H2CN
HCNN
HCNO
HOCN
HNCO
NCO
AR
C3H7
C3H8
CH2CHO
CH3CHO
N2
)
;

reactions
{
}
