tutorials/premixedFlame1D/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2006                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

scale   0.01;

vertices
(
    (0          0       0)
    (2.0        0       0)
    (2.0        0.25    0)
    (0          0.25    0)
    (0          0       0.25)
    (2.0        0       0.25)
    (2.0        0.25    0.25)
    (0          0.25    0.25)
);

blocks
(
    hex (0 1 2 3 4 5 6 7) (1350 1 1) simpleGrading (1 1 1)
);

edges
(
);

boundary
(
    inlet
    {
        type patch;
        faces
        (
           (4 7 3 0)
        );
    }
    outlet
    {
        type patch;
        faces
        (
            (1 2 6 5)
        );
    }

    frontAndBack
    {
        type empty;
        faces
        (
            (0 3 2 1)
            (4 5 6 7)
            (7 6 2 3)
            (1 0 4 5)
        );
    }
);

mergePatchPairs
(
);

// ************************************************************************* //
